
cask "alacritty"
cask "firefox"
cask "discord"
cask "docker"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "openvpn-connect"
cask "signal"
cask "slack"
cask "visual-studio-code"
cask "background-music"
cask "font-inconsolata-nerd-font"
cask "spaceid" # workspace id widget
#brew "font-liberation" # mostly for linux compat
brew "mpv"

# gnu tools are massively outdated or missing on mac
brew "bash"
brew "bash-completion@2"
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gpatch"
brew "gnupg"
brew "grep"
brew "less"
brew "make"
brew "rsync"
brew "watch"
brew "ssh-copy-id"

# cli
brew "jq"
brew "fzf"
brew "pass"
brew "hyperfine"
brew "eza"
brew "just"
brew "tokei"
brew "protobuf"
brew "bat"
brew "bats-core"
brew "fd"
brew "sd"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "vivid"
brew "helix"
brew "rust-analyzer"
brew "genact"
brew "pwgen"
brew "procs"
brew "direnv"
brew "dust"
brew "ruff"
brew "zoxide"
brew "yazi"
brew "pngquant"
brew "oxipng"
brew "choose-rust"
brew "git-delta"
brew "gh"
brew "gum"
brew "slides"
brew "cloudflared"
brew "ncspot"
brew "keychain"
brew "zola"
brew "zsh-fast-syntax-highlighting"
brew "zsh-autosuggestions"
brew "cargo-release"
brew "cargo-edit"
brew "cargo-audit"
brew "cargo-outdated"
brew "cargo-deny"
brew "cargo-binstall"

# language servers
brew "yaml-language-server"
brew "marksman"
brew "bash-language-server"
brew "terraform-ls"

# python
brew "ansible"
brew "ansible-lint"
brew "yamllint"
brew "yt-dlp"
brew "ranger"

# cloud
brew "kubectl"
brew "k3d"
brew "helm"
brew "k9s"
brew "terraform"
brew "lychee"

# taps
brew "kdash-rs/kdash/kdash"
brew "homeport/tap/dyff"
brew "fluxcd/tap/flux"
brew "int128/kubelogin/kubelogin"
brew "koekeishiya/formulae/yabai" # see roles/mac/tasks/yabai
